// Да се напише програма во C која како аргумент добива име на непостоечка датотека.
// Програмата најпрво креира дете процес. Родител процесот треба да генерира 1000 случајни
// броеви со помош на функцијата rand() (од библиотеката stdlib.h) и истите ги запишува на екран
// (кои со помош на редирекција се запишуваат во датотеката) и родител процесот завршува. Дете
// процесот проверува дали може да ја отвори датотеката, и ако не може заспива 1 секунда. Потоа
// проверува пак, и заспива пак 1 секунда, се додека не успее да ја отвори датотеката. Чим успее
// да ја отвори, чита 1000 броеви од тастатура (редиректирани од датотеката) и ги сместува во
// низа. Потоа, дете процесот, со помош на 4 нитки (секоја нитка пребарува по 250 броеви), го
// наоѓа најголемиот број и го печати на екран. 


//OD VIKI ZADACATA ISTATA